Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: - Finally.
ru: - Наконец то.

source: - I' il see you at the game.
ru: - Увидимся на игре.

source: - Slugger' s.
ru: - У Слаггера.

source: Someone' s gonna be here.
ru: В 11. 00 здесь.

source: I' il make sure someone' s here on Saturday for practice.
ru: Я найду кого- нибудь, кто потренирует вас в субботу.

source: Coach, can' t you at least give us a ride?
ru: Тренер, ты хотя бы отвезёшь нас домой?

source: I mean --
ru: Я хочу сказать --

source: - It' s early.
ru: - Ещё рано.

source: You can walk.
ru: Дойдёте пешком.

source: - Could you drop us off?
ru: - Ты нас бросаешь?

source: Don' t you think I might have something more important to do... than worry about you guys and your stupid little baseball team?
ru: А вы не думали, что у меня могут быть дела поважнее... чем вы, парни, и ваша глупая команда?

source: Can we please go in now?
ru: Мы можем войти?

source: I gotta take a piss.
ru: Я замёрз.

source: - We' re watching through the glass?
ru: - Мы будем смотреть через стекло?

source: - I feel better out here.
ru: - Здесь я себя лучше чувствую.

source: He can' t get in there.
ru: Они не могут этого сделать.

source: Jones fires.
ru: Джонс Файрс.

source: - Jones is ice cold!
ru: - Джонс спокоен, как камень!

source: Fourth quarter, we' re up by two points, you' re getting six.
ru: Четвёртая четверть, мы на два очка впереди, ты ставил на шесть.

source: - I don' t know what I' m gonna do.
ru: - Я не знаю, что я буду делать.

source: You' re up right now.
ru: Расслабься.

source: Ride it out.
ru: Спокойно.

source: Nice play by Tillman.
ru: Хорошая игра Тиллмана.

source: He' s got it.
ru: Попал.

source: Smith throws up a prayer.
ru: Смит бросает через игрока.

source: It' s good!
ru: Как хорошо!

source: Holy shit!
ru: Матерь божья!

source: - Should I look?
ru: - Мне посмотреть?

source: - No, no!
ru: - Нет, нет!

source: Not looking is working.
ru: Не смотри, всё нормально.

source: Keep not looking.
ru: Только не смотри.

source: Oh, God, Ticky.
ru: О, господи, Тикки.

source: Am I out of the woods?
ru: Могу я радоваться?

source: Miami inbounds.
ru: Майами прибавили.

source: Don' t foul!
ru: Только не фолите!

source: They fouled him!
ru: Они сфолили на нём!

source: Williams will shoot two!
ru: Вильямс будет пробивать два!

source: Never again.
ru: О, господи, Тикки.

source: - What' s happening?
ru: - Что происходит?

source: Talk to me!
ru: Скажи мне!

source: Williams at the line.
ru: Вильямс на линии.

source: - Williams makes the first.
ru: - Вильямс загнал первый.

source: - Shit, shit!
ru: - Чёрт, чёрт!

source: - He makes the second, you' re dead.
ru: Вильямс бросает.

source: - Williams shoots 80%.
ru: В корзине.

source: - What am I gonna do?
ru: - Что мне делать?

source: - Miami by seven.
ru: - Майами ведёт на семь.

source: Oh, my God, Ticky.
ru: О, господи, Тикки.

source: I was down 11 grand before I made this bet.
ru: Я был должен 11 штук до этой ставки.

source: Smith dribbles inside, half- court.
ru: Смит ведётся.

source: Heaves a 30- footer!
ru: Господи с тридцати футов!

source: It' s in!
ru: Есть!

source: - You covered!
ru: - Ты выиграл!

source: Yes, it' s good!
ru: Да, господи!

source: - What' s the final score?
ru: - Какой итоговый счёт?

source: Miami by four!
ru: Майами на четыре!

source: You covered!
ru: Ты выиграл!

source: - You covered 12 G' s!
ru: - Ты выиграл 12 штук!

source: - I covered!
ru: - Я выиграл!

source: Throw your hands in the air if you' s a true player
ru: Размахивай руками, если ты настоящий игрок

source: Got a gun up in your waist Please don' t shoot up the place
ru: Мне нравится, когда ты зовёшь меня Биг Паппа убери пушку, не стреляй здесь что потому что ты встретишь сегодня леди

source: - That should be havin 'my baby - Baby
ru: - Которая станет твоей крошкой - Крошкой

source: You take this party somewhere else.
ru: Устраивайте вечеринку где- нибудь в другом месте.

source: Kiss our ass, Duffy.
ru: Поцелуй нас в зад Даффи.

source: He beat Fink tonight for 12 grand!
ru: Сегодня мы выиграли у Финка 12 штук!

source: - You got my six grand?
ru: - Ты вернёшь мои шесть?

source: - Tomorrow.
ru: - Завтра.

source: Make yourself useful, huh?
ru: Эй поставь это, наслаждайся.

source: - So you took Fink for 12 large.
ru: - Итак, ты получишь с Финка ещё 12 штук.

source: Now what?
ru: А теперь что?

source: - What do you mean, you don' t know?
ru: - Что значит, не знаю?

source: We' re rolling it on the Bulls Saturday night.
ru: Мы заработали на Быках субботним вечером, сегодня.

source: I' il take that action on Ticky' s number if you wanna play it.
ru: Я запишу это на счёт Тикки.

source: We covered tonight.
ru: Мы заключили пари с Финком.

source: We got Vancouver Saturday night.
ru: И мы выиграли.

source: We' il cover again.
ru: Мы снова победили.

source: 24 grand.
ru: 24 штуки.

source: Then what?
ru: И что?

source: Hey, you think you just won the game of life?
ru: Эй, ты думаешь, что выиграл игру всей жизни?

source: - What next?
ru: - Что теперь?

source: If you win that, what are you gonna do with your life?
ru: Если это так, то что ты будешь делать со своей жизнью?

source: You gonna coach baseball for black kids?
ru: Ты будешь тренировать команду негритянских детей?

source: I don' t know, Duffy.
ru: Я не знаю, Даффи.

source: Maybe I' m just a loser, right?
ru: Может я просто неудачник?

source: Not like you.
ru: Не такой как ты.

source: Mr. Big Time, huh?
ru: Мистер большая удача, а?

source: - I' m just a loser.
ru: - Я просто неудачник.

source: - All right, O' Neill.
ru: - Хорошо, Онил.

source: I want my money tomorrow.
ru: Я хочу получить деньги завтра.

source: Night- night.
ru: Пока.

source: Time for beddy- bye, Coach.
ru: Пора в кроватку, тренер.

source: Don' t talk down to me!
ru: Не говори так!

source: You don' t know shit about those kids!
ru: Ты ничего не знаешь об этих детях!

source: Let' s go, let' s go.
ru: Пошли, пошли.

source: In a battle between two of the game' s brightest young hurlers... 21- year- old Jon Garland will face off against the red- hot Kerry Wood --
ru: Чикаго выкинули из интерлиги... сегодня состоится матч между Сокс и Чемиски. сражение между лучшими представителями бейсбола... 21- летний Джон Гарланд лицом к лицу с красным горячим Керри Вудсом --

source: It' s Ticky.
ru: Это Тикки.

source: I' m alone, I promise.
ru: Я один, я клянусь.

source: I' il take off my underwear and stand naked in your hallway to prove it.
ru: Я снял трусы и стою тут голый у тебя под дверью, чтобы доказать.

source: I' m naked now.
ru: Я голый.

source: I' il slide my nuts under your door till you let me in.
ru: Я буду засовывать свои трусы тебе под дверь до тех пор, пока ты меня не впустишь.

source: What' s up?
ru: Да в чём дело?

source: I paid Duffy.
ru: Я заплатил Даффи.

source: We' re square.
ru: Мы в расчёте.

source: Did you call Fink?
ru: Ты звонил Финку?

source: Are we down on the Bulls?
ru: Ты опять поставил на Быков?

source: How many points?
ru: На сколько очков?

source: Fink wants to see that I' ve still got his money.
ru: Финк хочет убедиться, что у меня есть деньги.

source: Let' s go by there, flash him a little cash and bet the 12 grand.
ru: Пойдём туда, покажем ему деньги и поставим твои 12 штук.

source: What' s with you?
ru: Да что с тобой?

source: We' re gonna do this, right?
ru: Мы же сделаем это верно?

source: Yeah, okay.
ru: Да, конечно.

source: - Jesus Christ.
ru: Я просто собирался на бейсбольное поле.

source: I thought you quit.
ru: - Господи, я думал, что ты ушёл.

source: - I did quit!
ru: - Я и так ушёл!

source: - I gotta drop the equipment off.
ru: - Я просто хочу избавиться от снаряжения.

source: Sammy Sosa will attempt to go yard for his fifth consecutive game... and the Big Hurt will attempt to break his 11- game hitting slump.
ru: ... матч между Сокс и Чемески. от Сэмми Соса ожидают хорошей игры... а Биг Харт проведёт свою одиннадцатую игру в этом составе.

source: We' re just an hour from game time.
ru: У нас всего час до игры.

source: We' il be back to take your calls.
ru: Мы вернёмся, чтобы принять ваши звонки.

source: See ya.
ru: Увидимся.

source: Hurry up, okay?
ru: Поторопись, хорошо?

source: - You here to tell us you quit?
ru: - Вы здесь, чтобы сказать нам, что вы уходите?

source: - That' s old news.
ru: - Это старые новости.

source: I left a message for Coach Jimmy I would drop off the equipment.
ru: Я получил сообщение от тренера Джимми, я должен раздать снаряжение.

source: He should be here any minute.
ru: Он будет здесь через минуту.

source: Keep goin ', sucker.
ru: - Да, вали сосунок.

source: - We goin 'to the' ship alone.
ru: - Мы пробьёмся в финал и без тебя.

source: I can' t bet the 12 grand.
ru: Я не могу поставить 12 штук.

source: We should just bet six grand... and wait till we get breathing room --
ru: Мы поставим только шесть штук... и будем ждать, что будет --

source: No, I can' t.
ru: Нет, я не могу.

source: Get your bum ass outta here, 'cause we a better team without you anyway.
ru: Вали отсюда, жирная задница, потому что мы и без тебя неплохо играем.

source: I' m not listening to any of you.
ru: Я не слушаю никого из вас.

source: I' m not listening to you or any of you!
ru: Я не слушаю вас, никого из вас!

source: So good luck.
ru: Удачи.

source: Good luck on your own.
ru: Удачи вам в ваших начинаниях.

source: Call me when you get to the 'ship without me.
ru: Позвоните, когда пробьётесь в финал.

source: Cold.
ru: Хорошо.

source: I' m so glad I' m done with this.
ru: Я так рад, что сделал это.

source: If Fink thinks we' re coming, we should at least stop by.
ru: Финк думает, что мы уже в пути, нам не следовало останавливаться.

source: If we don' t want to bet it, we don' t, you know, technically --
ru: Если мы не хотим ставить, мы не будем, ты знаешь, технически --

source: How many of you guys been to a big league park for a baseball game?
ru: Кто- нибудь из вас хоть раз был на играх высшей лиги, а?

source: That' s what I thought.
ru: Я так и думал.

source: You guys will never be a team until you see it played right.
ru: Вы, парни, никогда не научитесь играть, пока не увидите, как нужно играть.

source: Gimme that.
ru: Дай- ка это.

source: Listen, you' re stressed out.
ru: Слушай, ты перевозбуждён.

source: Let' s grab a bite.
ru: Ладно, давай это заберём.

source: - We can call and lay the bet.
ru: - Мы можем позвонить и сделать ставку.

source: - I' m out!
ru: - Я выхожу из игры!

source: I' m out!
ru: Я выхожу!

source: I' m out, I' m out, I' m out!
ru: Выхожу, выхожу, выхожу!

source: - You' re out.
ru: - Ты выходишь.

source: - I' m done.
ru: - Я уже вышел.

source: Well, you gotta call Fink for me.
ru: Позвони Финку, ради меня.

source: You can' t just dissolve a partnership like that.
ru: Ты не можешь разорвать такое партнёрство, как это.

source: I' m flapping in the breeze here.
ru: Меня шатает.

source: Seriously.
ru: Серьёзно.

source: I got nothin 'now.
ru: У меня нет ничего.

source: I' m flappin 'in the breeze here.
ru: Меня шатает ветром.

source: Get in the car.
ru: Все в машину.

source: Game starts in an hour.
ru: Игра начинается через час.

source: What are we doing?
ru: Что ты делаешь?

source: What is happening here?
ru: Да что здесь происходит?

source: Hey, let' s -- Let' s bet three grand.
ru: Эй, давай поставим три штуки.

source: Three grand will be fine.
ru: Три штуки будет в самый раз.

source: I mean, what' s goin 'on?
ru: Я не понял, что происходит?

source: Where we -- What are we doing?
ru: Куда вы -- что вы делаете?

source: Come on, wait.
ru: Эй, подожди.

source: Now wait, wait!
ru: Подожди, подожди!

source: This is against everything that' s right!
ru: Это против правил!

source: Hot dogs!
ru: Хот доги!

source: Get your hot dogs!
ru: Возьмите ваши Хот доги!

source: - Second row!
ru: - Второй ряд!

source: - Big league right now.
ru: - Высшая лига.

source: We got second row!
ru: У нас второй ряд!

source: Coach, thanks for the seats.
ru: Тренер, спасибо за места.

source: They hot, yo.
ru: Они горячие, йоу.

source: Yo, check it out!
ru: Эй, смотрите!

source: That' s Sammy Sosa over there!
ru: Это же Сэмми Соса!

source: - Right there!
ru: - Да вот!

source: Man, that ain' t no Sammy Sosa.
ru: Парни, это не Сэмми Соса.

source: Shut up, man!
ru: Да заткнись ты!

source: Look, y' all, look!
ru: Смотрите, смотрите!

source: There' s Sammy Sosa right there!
ru: Вот Сэмми Соса!

source: Right there!
ru: Вот он!

source: Missed me.
ru: Вы наверняка соскучились.

source: I wanted to apologize for the other night.
ru: Я хотел бы извиниться за тот вечер.

source: I have had better dates.
ru: Я знавала вечера и получше.

source: I heard about the baseball game.
ru: Я слышала про бейсбольный матч.

source: The boys loved it.
ru: Ребятам очень понравилось.

source: It worked.
ru: Я работал.

source: We' ve won three in a row since then.
ru: Мы выиграли трижды с тех пор.

source: Do you have any idea how much that meant to them?
ru: Вы хоть представляете, что это для них значит?

source: I was thinking... how the other night you knew that I wasn' t really a stock trader... and that I had a big gambling debt.
ru: Я думал... как вы тогда догадались, что я скупщик билетов... и что я азартный игрок.

source: And if you were there to offer me a job... it might still stand.
ru: И если вы по- прежнему предлагаете мне работу... то я согласен.

source: So you' re not here to ask me out.
ru: - Итак, вы здесь не для того, чтобы приглашать меня.

source: Am I supposed to be?
ru: А могу я рассчитывать?

source: We need a physical activities coordinator.
ru: Нам нужен преподаватель физкультуры.

source: - You and me?
ru: - Вам, я?

source: - The school.
ru: - Школе.

source: You know, someone to supervise after- school recess... organize games and sports.
ru: Кто- нибудь, кто будет организовывать всяческие спортивные мероприятия после занятий... игры и тому подобное.

source: - We' d like to get a guy because -- - I think you like me.
ru: - Нам нужен такой человек так как -- - Я думаю, я вам нравлюсь.

source: - I just got this gut feeling... when you were looking at me... that you like me.
ru: - Я просто чувствую... когда вы смотрите на меня... что я вам нравлюсь.

source: Are you interested?
ru: Вам интересно?

source: In the job?
ru: Вы о работе?

source: What are we talking about here?
ru: О чём мы вообще говорим?

source: I' m interested.
ru: Да, мне интересно.

source: I' m interested in anything I' m supposed to be interested in.
ru: Мне интересно всё, в чём я заинтересован.

source: Let' s go, Bua Was!
ru: Вперёд, Буа Вас!

source: What' s everybody lookin 'at?
ru: На что вы смотрите?

source: Why we gotta play them damn boo- boos again, man?
ru: Почему мы опять с ними играем?

source: They kicked our ass.
ru: Они надрали нам задницу.

source: The best records in Division A play to see who goes to the 'ship.
ru: Лучшая команда в дивизионе А, играет с теми, кто хочет выйти в финал.

source: If we win, we go to the 'ship.
ru: Если мы победим, мы в финале.

source: If we win.
ru: Если мы победим.

source: Everybody sit down.
ru: Садитесь на скамейку.

source: Take a seat.
ru: Садитесь.

source: Come on, Dre.
ru: Давай, Дрэ.

source: 'cause you played like a team.
ru: Неважно, что сегодня случится... вы, ребята, должны действительно гордиться сезоном, который вы провели... потому что вы играли, как команда.

source: I thought you should look like a team.
ru: И потому что вы играли как команда... я решил, что вы должны и выглядеть, как команда.

source: Jefferson Albert Tibbs...
ru: Джефферсон Альберт Тиббс...

source: I believe this is yours.
ru: Мне кажется это твоё.

source: - Man, that shit is tight!
ru: - Посмотрите, какая форма!

source: - Look at that!
ru: - Вы только посмотрите!

source: Fellas.
ru: Парни.

source: - There' s no more shirts in the box.
ru: - В коробке больше нет футболок.

source: - Nope.
ru: - Нет.

source: What is destiny?
ru: Какова наша цель?

source: Destiny is you' re supposed to win.
ru: Наша цель, выиграть.

source: Since you' re supposed to win, since I expect you to win... don' t you celebrate when you strike out one of these ridiculous --
ru: Как вы хотите выиграть, так и я жду вашей победы... я не помню, отмечали ли мы, когда в первый раз разгромили этих недоносков --

source: Hey, dogs, hats!
ru: Эй, кепки!

source: Sit down and act like champions.
ru: Сядьте, ведите себя, как подобает чемпионам.

source: You' re out!
ru: Успел!

source: Bua Was!
ru: Буа Вас!

source: - Blue.
ru: - Голубые.

source: - Time!
ru: - Тайм аут!

source: - Good job, Clarence.
ru: - Хорошая работа Кларенс.

source: - Thanks, Coach.
ru: - Спасибо, тренер.

source: Miles.
ru: Майлс.

source: Listen, we' re tied two- two.
ru: Послушай, счёт два- два.

source: We just need to get one guy out.
ru: Нам нужно всего одно очко.

source: Coach, I can' t pitch.
ru: Тренер, я не могу бросать.

source: These guys are really gonna sweat me.
ru: Эти ребята выбили меня из колеи.

source: They' re gonna yell, and then I can' t think.
ru: Они так играют, что я даже думать не успеваю.

source: This guy is one of the best hitters in the league.
ru: Эти ребята одни из лучших в лиге.

source: You' re in charge out here.
ru: Ты можешь.

source: Don' t rush.
ru: Не паникуй.

source: Hey, you can hear "Big Poppa" in your head, right?
ru: Эй, это потому что ты не слышишь "Биг Паппа" в ушах?

source: Just sometimes I lose the rhythm.
ru: Просто иногда я теряю ритм.

source: Miles, you' re great.
ru: Майлс, ты классный игрок.

source: I' m not worried.
ru: Я спокоен за тебя.

source: That should be havin 'my baby, baby
ru: Мне нравится, когда ты зовёшь меня Биг Паппа размахивай руками если ты настоящий игрок потому что встретишь ту леди и будешь звать её крошка, крошка

source: Strike one.
ru: Бой один.

source: - That should be havin 'my baby - Two!
ru: - И будешь звать её крошка, крошка - Два!

source: Strike three!
ru: Три!

source: Good going, Miles.
ru: Отлично, Майлс.

source: We' re tied two- two.
ru: Общий счёт два- два.

source: Last licks.
ru: - Осталась последняя игра.

source: We pull this out, we goin 'to the' ship.
ru: Выигрываем, выходим в финал.

source: Leading off, we' ve got Andre, we' ve got Ray Ray, we' ve got Clarence.
ru: Итак, у нас есть Андрэ, у нас есть Рэй Рэй, есть Кларенс.

source: After that, it' s you, Kofi, and then we' ve got Jefferson.
ru: Кроме того, ты Кофи, и Джефферсон.

source: Let' s go to the 'ship.
ru: Мы на пути в финал.

source: - Way to go, Dre!
ru: - Продолжай в том же духе, Дрэ!

source: Strike one!
ru: Бой один!

source: Two!
ru: Два!

source: Yeah, yeah, yeah.
ru: Да, да.

source: Nice job, Ray Ray.
ru: Отлично Рэй Рэй.

source: - Let' s go, Kofi!
ru: - Давай, Кофи!

source: Almost, Kofi.
ru: Почти, Кофи.

source: Two down.
ru: Проигрываем два.

source: Jefferson, how' re you doin '?
ru: Джефферсон, как ты?

source: You' re up.
ru: Ты в игре.

source: We' ve got Jarius Evans batting for Jefferson Tibbs.
ru: У нас замена Джариуса Эванса на Джефферсона Тиббса.

source: Wednesday night practice.
ru: Тренировка в среду.

source: Thanks for the uniform, Coach.
ru: Спасибо за форму, тренер.

source: - See you guys later.
ru: - Увидимся, ребята.

source: Hey, kid.
ru: Эй.

source: You can' t come in there right now.
ru: Вам нельзя сейчас сюда.

source: - How long it' s gonna be?
ru: - Как долго?

source: - Don' t know.
ru: - Не знаю.

source: Jamal, what' s up?
ru: Джамал, в чём дело?

source: Why can' t we go in right now?
ru: Почему нам нельзя пройти?

source: - They' re gonna cap somebody inside.
ru: - Они с кем- то разбираются внутри.

source: - What' re we gonna do?
ru: - Что мы будем делать?

source: Come on, man!
ru: Давай, чувак!

source: - Quiet.
ru: - Тише.

source: They' il pass by.
ru: Они сейчас уйдут.

source: - Come here!
ru: - Сюда!

source: - Get outta here!
ru: - Убираемся отсюда!

source: We' re okay.
ru: С нами всё будет в порядке.

source: G, we' re okay.
ru: Джи, мы в порядке.

source: G, come on, get up.
ru: Джи, давай, вставай.

source: We' il just wait for somebody to come.
ru: Мы просто подождём, пока кто- нибудь придёт.

source: I must
ru: О, господи.

source: We' ve heard testimony from those very close to our community.
ru: Мы скорбим, для нас всех это большая потеря.

source: Praise Jesus.
ru: Хвала господу.

source: I want to give a few more people the opportunity to say something on --
ru: Я хочу дать слово тем, кто хотел бы сказать что- нибудь --

source: on Jarius' s behalf.
ru: в память Джариуса.

source: Please, Mr. O' Neill.
ru: Пожалуйста, мистер Онил.

source: Come on up.
ru: Сюда.

source: Good morning.
ru: Доброе утро.

source: Jarius was a player on the Kekambas baseball team that I coach.
ru: Джариус был игроком Кекамбас, команды, которую я тренировал.

source: Honestly, he -- he was too young to play.
ru: Однако -- он был слишком маленьким, чтобы играть.

source: But he wanted to be a part of the team so badly that...
ru: Но он хотел быть частью команды...

source: I couldn' t say no.
ru: Я не мог этого ему запретить.

source: G - Baby.
ru: Джи- бэйби.

source: He had a great smile too.
ru: У него была замечательная улыбка.

source: I know I' m not telling you anything you don' t know.
ru: Я знаю, что не скажу вам ничего нового.

source: I' ve got Jarius Evans batting for Jefferson Tibbs.
ru: Я позволял Джи заменять Джефферсона Тиббса.

source: He was a really tough guy.
ru: Он был очень умным мальчиком.

source: Just a boy, really, who... wanted to be around his older brother.
ru: Мальчиком, который действительно... хотел быть похожим на старшего брата.

source: Hang on, Coach.
ru: Тренер.

source: I don' t have Jarius Evans on this roster anywhere.
ru: Я не вижу Джарета Эванса, в списках.

source: Oh, you know what?
ru: А знаете что?

source: He' s okay.
ru: Всё в порядке.

source: And, two outs in the last inning...
ru: На другой день...

source: I had no choice but to let Jarius bat.
ru: У нас была действительно очень важная игра.

source: You can swing if you want, but you don' t have to.
ru: Ты можешь играть, но ты не обязан.

source: If you go down looking, none of us care.
ru: Если у тебя что- то не получится, не беспокойся.

source: But if you want to swing, swing.
ru: Но если ты хочешь играть, играй.

source: Get back in there.
ru: Давай.

source: Do what you feel.
ru: Делай то, что ты хочешь.

source: He was fearless as he stepped to the plate.
ru: И он вышел на поле.

source: I was terrified for him.
ru: Я так за него боялся.

source: With two strikes and our hopes dwindling...
ru: Мы проигрывали два броска...

source: he hit a shot down the first baseline...
ru: он отбил первый же мяч...

source: and won the game.
ru: и победил в игре.

source: And watching him... raise his arms in triumph... as he ran to first base...
ru: И глядя на него... со вскинутыми руками от радости... как он бежит к первой базе...

source: I was lifted in that moment to a better place.
ru: Я клянусь... я не знал, были ли я и он когда- нибудь счастливей.

source: I swear he -- he lifted the world in that moment.
ru: Я клянусь -- он был на вершине мира в тот момент.

source: He made me... a better person... even if just for that moment.
ru: Он сделал меня... лучше...

source: I am... forever grateful to Jarius for that.
ru: Я... навсегда останусь благодарным Джариусу за это.

source: That was nice... what you said.
ru: Это было прекрасно... то, что вы сказали.

source: His mother was very moved.
ru: Спасибо вам.

source: There' s some people who want to talk to you about the baseball team.
ru: Здесь есть люди, которые хотят поговорить с вами, о бейсбольной команде.

source: The team is done.
ru: Команды больше нет.

source: That' s what they want to talk to you about.
ru: Это как раз то, о чём они хотят с вами поговорить.
